export default function MissionSection() {
    return (
        <section id="mission" className="w-full max-w-4xl mx-auto flex flex-col items-center">
            <div className="flex flex-col items-center mb-12">
                <div className="w-16 h-1 bg-[#923118] rounded-full mb-8"></div>
                <h2 className="text-[36px] font-bold text-text-main leading-10 mb-6 text-center" style={{ fontFamily: "'Plus Jakarta Sans', sans-serif" }}>
                    Tomoioのミッション
                </h2>

                <p className="text-[18px] font-medium text-text-muted leading-[29.3px] text-center max-w-[868.12px]">
                    Tomoio（トモイオ）は、日本とベトナムの文化を言語と交流を通じて深く結びつけるプラットフォームです。 単なる言語学習を超え、お互いの生活、価値観、伝統を共有することで、真の「友（Tomo）」を見つけ、未来を共に描く場を提供します。
                </p>
            </div>
            <div className="w-full grid grid-cols-1 md:grid-cols-2 gap-8">
                <div className="flex flex-col items-center bg-surface rounded-2xl pt-8 px-8 pb-14 text-center">

                    <div className="text-[#1B7575] w-[33.15px] h-7.5 mb-4 flex justify-center items-center">
                        <svg width="34" height="30" viewBox="0 0 34 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M16.35 30L23.175 12H26.325L33.15 30H30L28.3875 25.425H21.1125L19.5 30H16.35ZM4.5 25.5L2.4 23.4L9.975 15.825C9.1 14.95 8.30625 13.95 7.59375 12.825C6.88125 11.7 6.225 10.425 5.625 9H8.775C9.275 9.975 9.775 10.825 10.275 11.55C10.775 12.275 11.375 13 12.075 13.725C12.9 12.9 13.7563 11.7438 14.6438 10.2563C15.5312 8.76875 16.2 7.35 16.65 6H0V3H10.5V0H13.5V3H24V6H19.65C19.125 7.8 18.3375 9.65 17.2875 11.55C16.2375 13.45 15.2 14.9 14.175 15.9L17.775 19.575L16.65 22.65L12.075 17.9625L4.5 25.5ZM22.05 22.8H27.45L24.75 15.15L22.05 22.8Z" fill="#1B7575" />
                        </svg>
                    </div>

                    <h4 className="text-[18px] font-medium text-text-main leading-7 mb-2">
                        言語交換
                    </h4>

                    <p className="text-[14px] font-medium text-text-muted leading-5 max-w-[212.63px]">
                        リアルな会話を通じて、教科書にはない生きた言葉を学びます。
                    </p>
                </div>

                <div className="flex flex-col items-center bg-surface rounded-2xl pt-8 px-8 pb-14 text-center">

                    <div className="text-[#1B7575] w-9 h-4.5 mb-4 flex justify-center items-center">
                        <svg width="36" height="34" viewBox="0 0 36 34" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0 18V15.6375C0 14.5625 0.55 13.6875 1.65 13.0125C2.75 12.3375 4.2 12 6 12C6.325 12 6.6375 12.0063 6.9375 12.0188C7.2375 12.0312 7.525 12.0625 7.8 12.1125C7.45 12.6375 7.1875 13.1875 7.0125 13.7625C6.8375 14.3375 6.75 14.9375 6.75 15.5625V18H0ZM9 18V15.5625C9 14.7625 9.21875 14.0312 9.65625 13.3687C10.0938 12.7062 10.7125 12.125 11.5125 11.625C12.3125 11.125 13.2688 10.75 14.3813 10.5C15.4938 10.25 16.7 10.125 18 10.125C19.325 10.125 20.5438 10.25 21.6562 10.5C22.7687 10.75 23.725 11.125 24.525 11.625C25.325 12.125 25.9375 12.7062 26.3625 13.3687C26.7875 14.0312 27 14.7625 27 15.5625V18H9ZM29.25 18V15.5625C29.25 14.9125 29.1688 14.3 29.0063 13.725C28.8438 13.15 28.6 12.6125 28.275 12.1125C28.55 12.0625 28.8312 12.0312 29.1187 12.0188C29.4062 12.0063 29.7 12 30 12C31.8 12 33.25 12.3312 34.35 12.9937C35.45 13.6562 36 14.5375 36 15.6375V18H29.25ZM12.1875 15H23.85C23.6 14.5 22.9062 14.0625 21.7687 13.6875C20.6312 13.3125 19.375 13.125 18 13.125C16.625 13.125 15.3687 13.3125 14.2312 13.6875C13.0938 14.0625 12.4125 14.5 12.1875 15ZM6 10.5C5.175 10.5 4.46875 10.2062 3.88125 9.61875C3.29375 9.03125 3 8.325 3 7.5C3 6.65 3.29375 5.9375 3.88125 5.3625C4.46875 4.7875 5.175 4.5 6 4.5C6.85 4.5 7.5625 4.7875 8.1375 5.3625C8.7125 5.9375 9 6.65 9 7.5C9 8.325 8.7125 9.03125 8.1375 9.61875C7.5625 10.2062 6.85 10.5 6 10.5ZM30 10.5C29.175 10.5 28.4688 10.2062 27.8813 9.61875C27.2938 9.03125 27 8.325 27 7.5C27 6.65 27.2938 5.9375 27.8813 5.3625C28.4688 4.7875 29.175 4.5 30 4.5C30.85 4.5 31.5625 4.7875 32.1375 5.3625C32.7125 5.9375 33 6.65 33 7.5C33 8.325 32.7125 9.03125 32.1375 9.61875C31.5625 10.2062 30.85 10.5 30 10.5ZM18 9C16.75 9 15.6875 8.5625 14.8125 7.6875C13.9375 6.8125 13.5 5.75 13.5 4.5C13.5 3.225 13.9375 2.15625 14.8125 1.29375C15.6875 0.43125 16.75 0 18 0C19.275 0 20.3438 0.43125 21.2062 1.29375C22.0687 2.15625 22.5 3.225 22.5 4.5C22.5 5.75 22.0687 6.8125 21.2062 7.6875C20.3438 8.5625 19.275 9 18 9ZM18 6C18.425 6 18.7812 5.85625 19.0688 5.56875C19.3563 5.28125 19.5 4.925 19.5 4.5C19.5 4.075 19.3563 3.71875 19.0688 3.43125C18.7812 3.14375 18.425 3 18 3C17.575 3 17.2188 3.14375 16.9312 3.43125C16.6437 3.71875 16.5 4.075 16.5 4.5C16.5 4.925 16.6437 5.28125 16.9312 5.56875C17.2188 5.85625 17.575 6 18 6Z" fill="#1B7575" />
                        </svg>
                    </div>

                    <h4 className="text-[18px] font-medium text-text-main leading-7 mb-2">
                        コミュニティ
                    </h4>

                    <p className="text-[14px] font-medium text-text-muted leading-5 max-w-[211.64px]">
                        共通の趣味を持つ仲間と、国境を超えたつながりを築きます。
                    </p>
                </div>

            </div>
        </section>
    );
}